---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter
source: html/a6d0d97c-33ad-2950-b9d5-c273ba9ca116.htm
---
# PrimaryDesignOptionMemberFilter Members

Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.